Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.tree_MouseDoubleClick(System.Object,System.Windows.Forms.MouseEventArgs)
Double click of a bending radius node should select that node and close the dialog with the OK result
to match the classic dialog Select Reinforcement Bar behaviour
sender:
e: